app/controllers/articles_controller.rb

    def index
       @articles = Article.paginate(page: params[:page], per_page: 5)
---
SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"

    def create
        @article = Article.new(article_params)
        @article.user = User.first
        if @article.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "dasdasd"], ["description", "weqeqweqw"], ["created_at", "2021-06-13 10:24:20.355052"], ["updated_at", "2021-06-13 10:24:20.355052"], ["user_id", 2]]