app/controllers/users_controller.rb

    def update
        @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2021-06-13 07:55:20.559866"], ["password_digest", "joao"], ["id", 2]]